АвтосервисАвтомагазин/src/Catalogs/КА2_КлючиМоделей/КА2_КлючиМоделей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КА2_КлючиМоделей</name>
  <attributes>
    <name>ТипТС</name>
    <type>
      <types>CatalogRef.КА2_Типы</types>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.КА2_Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.КА2_Модели</types>
    </type>
  </attributes>
  <attributes>
    <name>Поколение</name>
    <type>
      <types>CatalogRef.КА2_Поколения</types>
    </type>
  </attributes>
  <attributes>
    <name>Кузов</name>
    <type>
      <types>CatalogRef.КА2_Кузова</types>
    </type>
  </attributes>
  <attributes>
    <name>Модификация</name>
    <type>
      <types>CatalogRef.КА2_Модификации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комплектация</name>
    <type>
      <types>CatalogRef.КА2_Комплектации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоколениеКузов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

АвтосервисАвтомагазин/src/Catalogs/КА2_КлючиМоделей/Forms/ФормаВыбора/Module.bsl
// 
//	Аутсорсинг Групп 
//		+7 495 241 10 64
//		+7 3852 59 50 96
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Марка = Неопределено;
	Модель = Неопределено;

	// Если в параметры переданы "Ссылка" с типом СправочникСсылка.КА2_НаименованияМарок и "Наименование" с типом
	// СправочникСсылка.КА2_НаименованияМоделей - получаем коллекцию поколений и устанавливаем отбор динамического списка
	Если Параметры.Свойство("Марка", Марка)
		 И Параметры.Свойство("Модель", Модель)
		 И ТипЗнч(Марка) = Тип("СправочникСсылка.КА2_НаименованияМарок")
		 И ТипЗнч(Модель) = Тип("СправочникСсылка.КА2_НаименованияМоделей") Тогда

		НаборПоколений = Справочники.КА2_Поколения.НайтиПоНаименованиямМаркиИМодели(Марка, Модель);
		НаборКузовов = Справочники.КА2_Кузова.НайтиПоНаименованиямМаркиИМодели(Марка, Модель);

		ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.Отбор,
																				 "ПоколениеИлиКузов",
																				 ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);

		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
															   "Поколение",
															   ВидСравненияКомпоновкиДанных.ВСписке,
															   НаборПоколений,
															   ,
															   ЗначениеЗаполнено(НаборПоколений));
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
															   "Кузов",
															   ВидСравненияКомпоновкиДанных.ВСписке,
															   НаборКузовов,
															   ,
															   ЗначениеЗаполнено(НаборКузовов));

		СтандартнаяОбработка = Ложь;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	РезультатВыбора = Новый Структура("Марка, Модель, Поколение, Кузов, ПоколениеКузов");
	ЗаполнитьЗначенияСвойств(РезультатВыбора, Элемент.ТекущиеДанные);

	ОповеститьОВыборе(РезультатВыбора);

КонецПроцедуры

#КонецОбласти
